package ru.itis.summerpractice24

object MusicRepository {
    val musics: List<Music> = listOf(
        Music(
            id = 0,
            name = "Мотылёк",
            autor = "Макс Корж",
            imgURL = "https://lastfm.freetls.fastly.net/i/u/ar0/00d6001011be0610c37d2c9c237930a1.jpg",
            album = "Жить в кайф",
            text = """
            Ну что ты, братишка, притих
            Обида залита в груди
            Не можешь ни хавать, ни пить
            Сука, не хочется жить
            Дарил ей столько добра
            Ввалил в неё столько бабла
            Ты думал лишь ты и она
            И спокойно ладил дела
            Сколько потерянных дней
            Конечно, может быть всякое, но только не с ней
            Сколько потерянных лет
            Обида прожигает грудь до боли сильнее
            Ничего, потерпи месяцок
            Я это сам не по рассказам знаю
            Что скоро твой любимый мотылёк
            В твоих глазах станет обычной тварью
            Я затолкаю тебя в тачку силой
            Я отвезу тебя к пацанам!
            Там банька, рыбка и пиво
            Братишка, я тебе сдохнуть не дам!
            Как много в мире девушек красивых
            Искренних, верных, да, и простых
            Такая вот терапия…
            Будет ещё больней, но ты держись!
            Оттого порою грустно, что в жизни бывает
            Много несправедливых вещей
            Того, кто о нас ноги вытирает
            Как ни странно, мы любим, блять, да ещё сильнее!
            Ты будешь вырываться и бежать к ней
            Я тебя крепко свяжу
            Ты столько лет доверял ей напрасно
            Теперь, братишка, доверься Коржу
            Сколько с тобой изведаем стран
            Сколько с тобой заработаем бабок
            Сколько с тобой попробуем баб:
            Азиаток, метисок, мулаток
            Теперь ты знаешь, что от них ожидать (ожидай!)
            Не попадёшься больше в эти лапы (никогда!)
            Ты знаешь, в жизни есть только мать
            Только она будет любить тебя сильным и слабым
            Конечно, эта сука приползёт — и очень быстро
            И со старта зальёт тебе в уши
            Она натрахалась вдоволь со своим футболистом
            Теперь ей хочется стабильности, хочется куша
            Ты посмотри, братан, какой закат
            Всё остальное, брат, такая мелочь
            Санёк, лильни ему чё-нить в стакан
            Чтобы не думал чё с собой делать
            Я затолкаю тебя в тачку силой
            Я отвезу тебя к пацанам!
            Там банька, рыбка и пиво
            Братишка, я тебе сдохнуть не дам!
            Как много в мире девушек красивых
            Искренних, верных, да, и простых
            Такая вот терапия…
            Такая вот взрослая жизнь…
        """.trimIndent()
        ),
        Music(
            id = 1,
            name = "Круговорот",
            autor = "Miyagi & Эндшпиль",
            imgURL = "https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_65a14dbaae32d77f9bbe3eb4_65a14f1aced5a46319918f6d/scale_1200",
            album = "NARRATIVE",
            text = """
            [Интро: Miyagi]
            М-м-м-а-а-а
            М-м-м-а-а-а
            [Припев: Miyagi]
            Круговоротами дивных событий
            Обрывками вредными времени жил
            Нервы кидались словами небрежными
            Ты меня прежнего больше не жди
            Бегство — не выход, но крах — это прихоть
            И вихрями лихо замыливал свет
            Я растворялся с тобой в этом облике полностью
            Снова, как дым сигарет
            Круговоротами дивных событий
            Обрывками вредными времени жил
            Нервы кидались словами небрежными
            Ты меня прежнего больше не жди
            Бегство — не выход, но крах — это прихоть
            И вихрями лихо замыливал свет
            Я растворялся с тобой в этом облике полностью
            Снова, как дым сигарет
            [Куплет 1: Miyagi]
            На закате дня мы рисовали горизонт
            Искрами до неба в невесомости паря
            Так же продолжали мы дышать в унисон
            Но уповали друг на друга мы, чувств не тая
            Верю в то, что звёзды нам благоволят
            Окутали туманы, но мы грели сердца
            Эта любовь — бесконечность, чувства как вечность
            Я с тобой до конца
            [Бридж: Эндшпиль]
            А-а-а
            [Куплет 2: Эндшпиль]
            Милая, не бойся, я рядом
            Приду к тебе с оранжевым закатом
            Найду самые чистые мысли
            И подарю на память свои письма
            Забудем о былом, построим счастье вместе
            Запятнанные строчки на сердце — вечность
            Сколько сказано слов, но не хватит и жизни
            Чтоб описать мою любовь к тебе
            Полетели в бесконечность
            Я всегда буду рядом с тобой
            [Аутро: Эндшпиль]
            А-а-а, я всегда буду рядом с тобой
            А-а-а, я всегда буду рядом с тобой
            А-а-а
        """.trimIndent()
        ),
        Music(
            id = 2,
            name = "Это любовь",
            autor = "Скриптонит",
            imgURL = "https://mypensia.ru/uploads/images/j/i/l/jillzay_1.jpg",
            album = "Дом с нормальными явлениями",
            text = """
            Я опять на районе потерял себя в одном из дворов
            Ты опять мне трезвонишь, чтобы знать, что я жив и здоров
            Среди тех пацанов, барыг и быков, машин, мусоров
            Я пообещал бросить дуть и пить, ведь это любовь
            Руки в петли, руки прямо как узлы, руки на замок
            Руки в пепле, губы об твои губы, глаза в потолок
            Я снова в дверях, руки врозь, прости, что валюсь с ног
            Я снова пообещал всё, что смог, ведь это любовь
            Ещё одной тёмной ночью (каждый твой вдох)
            И каждый твой выдох (кричит об одном)
            Ещё одним холодным утром (руки без слов)
            Кричат об одном (это любовь)
            Ты опять в телефоне ищешь сообщения шлюх, пока сплю
            Ты опять их находишь, будишь и орёшь, все нервы к нулю
            Среди кресел, столов и полок, посуда в пол, я тебя ловлю
            Ты снова прощаешь всё, а руки говорят: "Я люблю"
            Я опять с самолёта в самолёт, в поезда
            Ты опять в переезде 5 часов, не устав
            Я с дороги в дом, ты туда же, всё в привычных цветах
            Ты опять оторвёшь, не удержав, я люблю
            Ещё одной тёмной ночью (каждый твой вдох)
            И каждый твой выдох (кричит об одном)
            Ещё одним холодным утром (руки без слов)
            Кричат об одном (это любовь)
            Ещё одной тёмной ночью
            И каждый твой выдох
            Ещё одним холодным утром (руки без слов)
            Кричат об одном
            Ещё одной тёмной ночью (каждый твой вдох)
            И каждый твой выдох (кричит об одном)
            Ещё одним холодным утром (руки без слов)
            Кричат об одном (это любовь)
            Это любовь
            Кричат об одном — это любовь
            Любовь, любовь, любовь
            Любовь
            Я опять на районе потерял себя в одном из дворов
            Ты опять мне трезвонишь, чтобы знать, что я жив и здоров
            Среди тех пацанов, барыг и быков, машин, мусоров
            Я пообещал бросить дуть и пить, ведь это любовь
        """.trimIndent()
        ),
        Music(
            id = 3,
            name = "Slow Mo",
            autor = "Armich, Скриптонит",
            imgURL = "https://lastfm.freetls.fastly.net/i/u/ar0/ce882265996c2dd29d3c084d7946ced7.jpg",
            album = "Смесь",
            text = """
            [Куплет 1: Armich]
            Пальцы на пальцах, и я здесь
            Солнце погасло, ты проснись
            Голова больная - холодный лист
            На моей подушке снова снег и сны

            Я сбитый псих, ритмы в такт мне плывут
            Видимый мир мой накрыт снегом труп
            Половина жизни, помню, бегал - тул
            Другая половина - яд, небо - дуло

            Я тебя не видел несколько часов
            По мне поёт музыка - сон

            [Куплет 2: Скриптонит]
            Где ты? Где ты?
            Где ты? Где ты? Где ты?

            Хочу, чтоб ты знала, что я - твой раб
            Если ты придешь - выплыву назад
            И навсегда, любимая, запомни меня
            Я твоя любовь, а ты - моя звезда

            Не убивай себя, прошу, стой
            Я хочу с тобой всю жизнь вдвоем
            Держись, держись, держись, держись
            Мы победим это дерьмо вдвоем

            Пальцы на пальцах, и я здесь
            Солнце погасло, ты проснись
            Голова больная - холодный лист
            На моей подушке снова снег и сны

            Я сбитый псих, ритмы в такт мне плывут
            Видимый мир мой накрыт снегом труп
            Половина жизни, помню, бегал - тул
            Другая половина - яд, небо - дуло

            Я тебя не видел несколько часов
            По мне поёт музыка - сон
        """.trimIndent()
        ),
        Music(
            id = 4,
            name = "Танцы",
            autor = "NLO",
            imgURL = "https://lastfm.freetls.fastly.net/i/u/ar0/ed5c28cb9c1c0abc196ad6da515b4ec4.jpg",
            album = "Молодость для тус",
            text = """
            [Куплет 1: Стёпа]
            Приходи ко мне вечером, я люблю
            Наши летние встречи, тепло, июль
            Так давай обниматься, горит огонь
            Я куплю тебе платье, ты подожди

            [Куплет 2: Паша]
            Я возьму тебя за руку, мы пойдём
            Через все переулки в наш дом родной
            Будем пить и смеяться до темноты
            Ты же знаешь, что я хочу, чтобы ты

            [Припев: Все]
            Танцевала, танцевала
            До утра со мной
            Танцевала, танцевала
            До утра со мной

            [Куплет 3: Гоша]
            Наши дни пролетели как дым, как сон
            Но мы будем с тобой вечно молодыми
            Всё, что было, останется с нами всегда
            Это лето — любовь, и она — моя звезда

            [Припев: Все]
            Танцевала, танцевала
            До утра со мной
            Танцевала, танцевала
            До утра со мной
        """.trimIndent()
        ),
        Music(
            id = 5,
            name = "Малинки",
            autor = "Дискотека Авария, Жанна Фриске",
            imgURL = "https://is1-ssl.mzstatic.com/image/thumb/Music114/v4/b4/2c/ba/b42cbaf2-29c8-1e35-b44e-bdd5208b2690/cover.jpg/800x800bb.jpg",
            album = "Четверо Парней",
            text = """
            А я ни разу не была в Малинках до этого дня
            Точнее до вечера
            Но тут приехал за мной сам Авария, и мы улетели туда
            Только одна ночь в Малинках — и я пропала, друзья

            Ты со мной, я с тобой
            Мы начнём, повторяй за мной

            Малинки, малинки
            Такие вечеринки
            Зелёные тропинки
            Где мы с тобой танцуем в этом лесу
            Малинки, малинки
            Румяные щёчки, тридцатые каплиночки
            Ты пойдёшь домой — я тебя не отпущу

            Ой, такая крокодила, всё своё
            Я не пойму, откуда ты, кого ты звал
            Ты чё молчишь, а я ревную и злюсь
            А ты, что у тебя за мысли?
            Ты чё молчишь, я так сильно волнуюсь
            Хочется тебе сказать, чтоб ты целовала меня, целовала меня
            Но всё было не так просто

            Малинки, малинки
            Такие вечеринки
            Зелёные тропинки
            Где мы с тобой танцуем в этом лесу
            Малинки, малинки
            Румяные щёчки, тридцатые каплиночки
            Ты пойдёшь домой — я тебя не отпущу

            Вау, вау, вау
            Ты мне говоришь: "Уау, вау, вау"
            Только не говори: "Мау, мау, мау"
            Ты же знаешь, как люблю тебя

            Малинки, малинки
            Такие вечеринки
            Зелёные тропинки
            Где мы с тобой танцуем в этом лесу
            Малинки, малинки
            Румяные щёчки, тридцатые каплиночки
            Ты пойдёшь домой — я тебя не отпущу
        """.trimIndent()
        ),
        Music(
            id = 6,
            name = "Знаешь ли ты",
            autor = "МакSim",
            imgURL = "https://torrent-music.3dn.ru/i47b8991a7ecfa.jpg",
            album = "Трудный возраст",
            text = """
            Я так привыкла жить одним тобой, одним тобой.
            Встречать рассвет и слышать, как проснешься не со мной.
            Мне кажется, что это был лишь сон, и я сейчас
            Открою глаза, а ты по-прежнему дышишь

            Знаешь ли ты, вдоль ночных дорог
            Шла босиком, не жалея ног,
            Сердце его теперь в твоих руках
            Не потеряй его и не сломай.
            Чтобы не нести вдоль ночных дорог
            Пепел любви в руках, сбив ноги в кровь,
            Пульс его теперь в твоих глазах.
            Не потеряй его и не сломай.

            И в январе пусть в твоем календаре
            Не будет дней, где нет меня.
            Где нет меня, твои шаги — шаги безумия
            Моя любовь жива и будет жить в твоих глазах.

            Знаешь ли ты, вдоль ночных дорог
            Шла босиком, не жалея ног,
            Сердце его теперь в твоих руках
            Не потеряй его и не сломай.
            Чтобы не нести вдоль ночных дорог
            Пепел любви в руках, сбив ноги в кровь,
            Пульс его теперь в твоих глазах.
            Не потеряй его и не сломай.

            Знаешь ли ты, вдоль ночных дорог
            Шла босиком, не жалея ног,
            Сердце его теперь в твоих руках
            Не потеряй его и не сломай.
            Чтобы не нести вдоль ночных дорог
            Пепел любви в руках, сбив ноги в кровь,
            Пульс его теперь в твоих глазах.
            Не потеряй его и не сломай.
        """.trimIndent()
        )
    )

}